h = 0
while h < 24:
    m = 0 
    while m < 60:
        s = 0
        while s < 60:
            print(f'{h:02}:{m:02}:{s:02}')
            if h==23 and m==55 and s==58:
                print('Alarme')
                break
            s+=1
        if h==23 and m==55:
            break
        m+=1
    if h==23:
        break
    h+=1
    
    print("Alarme")
    
    ☺☻♥♦♣♠•◘○◙♂♀♪♫☼►◄↕‼¶§▬↨↑↓→←∟↔▲▼ !"#"#$%&'())*)+♦♦-./0012348;<=>6♥?@ABEKPUWQXY[][]\]\_``abdc☺efinsvwxyxyz{}|}~⌂Çüéâäàåççêëèï◙ìÄÅÉæÆ